USE KB301_Bolshakov
GO

INSERT INTO IDZ.Authors
VALUES
(1, 'Фёдор Михайлович Достоевский', '11.11.1821'),
(2, 'Лев Николаевич Толстой', '09.09.1828'),
(3, 'Дмитрий Алексеевич Глуховский', '12.06.1979'),
(4, 'Говард Филлипс Лавкрафт', '20.08.1890'),
(5, 'Александр Сергеевич Пушкин', '06.06.1799'),
(6, 'Александр Сергеевич Грибоедов', '15.01.1795'),
(7, 'Михаил Юрьевич Лермонтов', '15.10.1814'),
(8, 'Стивен Кинг', '21.09.1947'),
(9, 'Гузель Шамилиевна Яхина', '01.06.1977'),
(10, 'Евгения Игоревна Некрасова','02.04.1985'),
(11, 'Антон Павлович Чехов','29.01.1860')

INSERT INTO IDZ.PublishingHouse
VALUES
(1, '«Азбука-Аттикус»', 'Москва'),
(2, '«Армада»', 'Москва'),
(3, '«Питер-Софт»', 'Санкт-Петербург'),
(4, '«Специальная Литература»', 'Санкт-Петербург'),
(5, '«Мир хобби»', 'Уфа'),
(6, '«Европа»', 'Воронеж')


INSERT INTO IDZ.Deliveries
VALUES
(3, 'Коновалов Максим Серегеевич', 'Доставка Книг', 'Респ. Башкортостан, г.Бирск, ул.Интернациональная, д.14', '89881689578', '482608019236'),
(7, 'Гильванов Роман Евгеньевич', 'Бистро', '', '89174568936', '456326982464'),
(9, 'Косолапов Кирилл Сергеевич', 'BooksClub', 'г. Москва, ул. Ленина, д.46', '89995648924', '456982314584'),
(11, 'Павлов Никита Андреевич', 'Заветная Книга', 'г. Санкт-Петербург, ул. Карла-Маркса', '89568695423', '458963217855'),
(14, 'Султанов Вадим Айратович', 'Золото Башкирии', 'Респ. Башкортостан, г. Уфа, ул. Мира, д. 123', '89871568456', '485693215899')


INSERT INTO IDZ.Books
VALUES
(1, 'Война и мир', 2, 1300, 3),
(2, 'Анна Каренина', 2, 960, 1),
(3, 'Преступление и наказание', 1, 432, 2),
(4, 'Идиот', 1, 640, 4),
(5, 'Метро 2033', 3, 384, 5),
(6, 'Текст', 3, 263, 2),
(7, 'Модель для Пикмана', 4, 320, 6),
(8, 'Тень над Иннсмутом', 4, 352, 6),
(9, 'Евгений Онегин', 5, 288, 1),
(10, 'Капитанская дочка', 5, 160, 2),
(11, 'Горе от ума', 6, 176, 4),
(12, '1812', 6, 353, 3),
(13, 'Мцыри', 7, 192, 2),
(14, 'Герой нашего времени', 7, 224, 6),
(15, 'Оно', 8, 1392, 6),
(16, 'Кладбище домашних животных', 8, 480, 4),
(17, 'Зулейха открывает глаза', 9, 562, 2),
(18, 'Эшелон на Самарканд', 9, 521, 6),
(19, 'Калечина-Малечина', 10, 256, 3),
(20, 'Вишнёвый сад',11, 305, 5)


INSERT INTO IDZ.Purchases
VALUES
(1,'08.10.2022',7, 'False', 2500, 100, 1),
(2,'09.10.2022',3, 'False', 1800, 50, 2),
(3,'09.10.2022',11, 'False', 2200, 75, 2),
(4,'11.10.2022',7, 'True', 1000, 5, 3),
(5,'12.10.2022',14, 'True', 1500, 4, 5),
(6,'12.10.2022',3, 'True', 1000, 1, 5),
(7,'1.11.2022',14, 'True', 2000, 3, 6),
(8,'1.11.2022',9, 'True', 1500, 5, 6),
(9,'5.11.2022',7, 'False', 1300, 100, 7),
(10,'5.11.2022',9, 'False', 1100, 70, 7),
(11,'15.11.2022',14, 'False', 1000, 100, 8),
(12,'16.11.2022',14, 'False', 900, 30, 9),
(13,'22.11.2022',11, 'True', 1700, 7, 10),
(14,'22.11.2022',7, 'False', 1500, 45, 10),
(15,'1.12.2022',11, 'True', 1500, 8, 11),
(16,'1.12.2022',11, 'True', 1200, 5, 11),
(17,'09.12.2022',9, 'True', 1000, 9, 12),
(18,'09.12.2022',9, 'True', 800, 8, 12),
(19,'13.12.2022',3, 'True', 500, 5, 13),
(20,'13.12.2022',14, 'False', 1200, 35, 14)
