Use master
Go

INSERT INTO [KB301_Bolshakov].Навигация.Shop 
 (Shop_name, Market_street, Market_home)
 VALUES 
 ('Пятерочка','Пушкина','27б'),
 ('Магнит','Пушкина','29'),
 ('Монетка','Мира','106'),
 ('Пятерочка','Ленина','35'),
 ('Верный','Большакова','37'),
 ('Монетка','Гоголя','100')
GO

INSERT INTO [KB301_Bolshakov].Навигация.Group_Item
 (Group_name)
 VALUES 
	('Хлебобулочные'),
	('Молочная продкуция'),
	('Алкоголь'),
	('Мясо'),
	('Полуфабрикаты'),
	('Товары для детей')

GO


INSERT INTO [KB301_Bolshakov].Навигация.Item
 (Group_id, Item_name, Unit)
 VALUES 
	(1, 'Хлеб', 'шт'),
	(1, 'Батон', 'шт'),
	(2, 'Молоко', 'литр'),
	(2, 'Йогурт', 'литр'),
	(3, 'Пиво', 'литр'),
	(3, 'Водка', 'литр'),
	(4, 'Свинина', 'кг'),
	(4, 'Курица', 'кг'),
	(5, 'Пельмени', 'кг'),
	(5, 'Фрикадельки', 'кг'),
	(6, 'Каша', 'г'),
	(6, 'Фркутовое пюре', 'шт')
GO 

INSERT INTO [KB301_Bolshakov].Навигация.Storage
  (Market_street, Market_home, Item_id, Item_date, Price, Item_count, Item_status)
  VALUES
	('Большакова', '37', 1, CAST('2022-10-11 00:00:00' AS smalldatetime), 30, 100, 1),
	('Большакова', '37', 2, CAST('2022-10-11 00:00:00' AS smalldatetime), 42, 200, 1),
	('Большакова', '37', 3, CAST('2022-11-11 00:00:00' AS smalldatetime), 60, 75, 1),
	('Большакова', '37', 4, CAST('2022-12-11 00:00:00' AS smalldatetime), 120, 0, -1),
	('Большакова', '37', 5, CAST('2022-13-11 00:00:00' AS smalldatetime), 100, 0, 1),
	('Большакова', '37', 6, CAST('2022-11-11 00:00:00' AS smalldatetime), 700, 0, -1),
	('Большакова', '37', 7, CAST('2022-12-11 00:00:00' AS smalldatetime), 350, 25, 1),
	('Большакова', '37', 8, CAST('2022-14-11 00:00:00' AS smalldatetime), 290, 50, 1),
	('Большакова', '37', 9, CAST('2022-17-11 00:00:00' AS smalldatetime), 210, 120, -1),
	('Большакова', '37', 10, CAST('2022-19-11 00:00:00' AS smalldatetime), 300, 0, 1),
	('Большакова', '37', 11, CAST('2022-20-11 00:00:00' AS smalldatetime), 1, 77000, -1),
	('Большакова', '37', 12, CAST('2022-11-11 00:00:00' AS smalldatetime), 50, 5, 1),

	('Гоголя', '100', 1, CAST('2022-14-11 00:00:00' AS smalldatetime), 32, 150, 1),
	('Гоголя', '100', 2, CAST('2022-18-11 00:00:00' AS smalldatetime), 40, 300, -1),
	('Гоголя', '100', 3, CAST('2022-23-11 00:00:00' AS smalldatetime), 61, 150, -1),
	('Гоголя', '100', 4, CAST('2022-12-11 00:00:00' AS smalldatetime), 122, 3, 1),
	('Гоголя', '100', 5, CAST('2022-23-11 00:00:00' AS smalldatetime), 100, 4, 1),
	('Гоголя', '100', 6, CAST('2022-8-11 00:00:00' AS smalldatetime), 800, 5, 1),
	('Гоголя', '100', 7, CAST('2022-9-11 00:00:00' AS smalldatetime), 400, 25, -1),
	('Гоголя', '100', 8, CAST('2022-10-11 00:00:00' AS smalldatetime), 300, 50, -1),
	('Гоголя', '100', 9, CAST('2022-17-11 00:00:00' AS smalldatetime), 210, 120, 1),
	('Гоголя', '100', 10, CAST('2022-23-11 00:00:00' AS smalldatetime), 305, 100, 1),
	('Гоголя', '100', 11, CAST('2022-22-11 00:00:00' AS smalldatetime), 2, 36000, -1),
	('Гоголя', '100', 12, CAST('2022-30-11 00:00:00' AS smalldatetime), 51, 300, 1),

	('Ленина', '35', 1, CAST('2022-30-11 00:00:00' AS smalldatetime), 35, 150, 1),
	('Ленина', '35', 2, CAST('2022-20-11 00:00:00' AS smalldatetime), 100, 300, 1),
	('Ленина', '35', 3, CAST('2022-23-11 00:00:00' AS smalldatetime), 62, 150, -1),
	('Ленина', '35', 4, CAST('2022-25-11 00:00:00' AS smalldatetime), 123, 0, 1),
	('Ленина', '35', 5, CAST('2022-16-11 00:00:00' AS smalldatetime), 120, 0, -1),
	('Ленина', '35', 6, CAST('2022-26-11 00:00:00' AS smalldatetime), 1000, 0, -1),
	('Ленина', '35', 7, CAST('2022-13-11 00:00:00' AS smalldatetime), 375, 25, 1),
	('Ленина', '35', 8, CAST('2022-16-11 00:00:00' AS smalldatetime), 250, 50, -1),
	('Ленина', '35', 9, CAST('2022-17-11 00:00:00' AS smalldatetime), 210, 120, 1),
	('Ленина', '35', 10, CAST('2022-18-11 00:00:00' AS smalldatetime), 301, 100, 1),
	('Ленина', '35', 11, CAST('2022-21-11 00:00:00' AS smalldatetime), 1, 1500, 1),
	('Ленина', '35', 12, CAST('2022-22-11 00:00:00' AS smalldatetime), 48, 300, -1),

	('Мира', '106', 1, CAST('2022-13-11 00:00:00' AS smalldatetime), 35, 0, 1),
	('Мира', '106', 2, CAST('2022-11-11 00:00:00' AS smalldatetime), 45, 0, 1),
	('Мира', '106', 3, CAST('2022-21-11 00:00:00' AS smalldatetime), 63, 0, 1),
	('Мира', '106', 4, CAST('2022-30-11 00:00:00' AS smalldatetime), 122, 0, -1),
	('Мира', '106', 5, CAST('2022-12-11 00:00:00' AS smalldatetime), 130, 10000, -1),
	('Мира', '106', 6, CAST('2022-21-11 00:00:00' AS smalldatetime), 1200, 1000, 1),
	('Мира', '106', 7, CAST('2022-20-11 00:00:00' AS smalldatetime), 380, 0, -1),
	('Мира', '106', 8, CAST('2022-30-11 00:00:00' AS smalldatetime), 270, 0, -1),
	('Мира', '106', 9, CAST('2022-20-11 00:00:00' AS smalldatetime), 210, 0, 1),
	('Мира', '106', 10, CAST('2022-25-11 00:00:00' AS smalldatetime), 299, 0, -1),
	('Мира', '106', 11, CAST('2022-13-11 00:00:00' AS smalldatetime), 2, 1500, 1),
	('Мира', '106', 12, CAST('2022-17-11 00:00:00' AS smalldatetime), 36, 300, -1),

	('Пушкина', '27б', 1, CAST('2022-25-11 00:00:00' AS smalldatetime), 25, 200, -1),
	('Пушкина', '27б', 2, CAST('2022-23-11 00:00:00' AS smalldatetime), 37, 300, 1),
	('Пушкина', '27б', 3, CAST('2022-15-11 00:00:00' AS smalldatetime), 59, 150, -1),
	('Пушкина', '27б', 4, CAST('2022-17-11 00:00:00' AS smalldatetime), 130, 3, -1),
	('Пушкина', '27б', 5, CAST('2022-27-11 00:00:00' AS smalldatetime), 129, 0, 1),
	('Пушкина', '27б', 6, CAST('2022-29-11 00:00:00' AS smalldatetime), 3500, 0, -1),
	('Пушкина', '27б', 7, CAST('2022-26-11 00:00:00' AS smalldatetime), 377, 40, -1),
	('Пушкина', '27б', 8, CAST('2022-1-11 00:00:00' AS smalldatetime) , 350, 50, 1),
	('Пушкина', '27б', 9, CAST('2022-3-11 00:00:00' AS smalldatetime), 210, 120, -1),
	('Пушкина', '27б', 10, CAST('2022-5-11 00:00:00' AS smalldatetime), 398, 100, -1),
	('Пушкина', '27б', 11, CAST('2022-3-11 00:00:00' AS smalldatetime), 2, 225000, 1),
	('Пушкина', '27б', 12, CAST('2022-2-11 00:00:00' AS smalldatetime), 36, 100, -1),

	('Пушкина', '29', 1, CAST('2022-20-11 00:00:00' AS smalldatetime), 27, 200, -1),
	('Пушкина', '29', 2, CAST('2022-23-11 00:00:00' AS smalldatetime), 34, 300, -1),
	('Пушкина', '29', 3, CAST('2022-25-11 00:00:00' AS smalldatetime), 75, 150, 1),
	('Пушкина', '29', 4, CAST('2022-26-11 00:00:00' AS smalldatetime), 150, 3, -1),
	('Пушкина', '29', 5, CAST('2022-28-11 00:00:00' AS smalldatetime), 100, 0, -1),
	('Пушкина', '29', 6, CAST('2022-21-11 00:00:00' AS smalldatetime), 1200, 0, 1),
	('Пушкина', '29', 7, CAST('2022-20-11 00:00:00' AS smalldatetime), 400, 40, -1),
	('Пушкина', '29', 8, CAST('2022-14-11 00:00:00' AS smalldatetime), 400, 50, 1),
	('Пушкина', '29', 9, CAST('2022-16-11 00:00:00' AS smalldatetime), 210, 120, -1),
	('Пушкина', '29', 10, CAST('2022-17-11 00:00:00' AS smalldatetime), 305, 100, -1),
	('Пушкина', '29', 11, CAST('2022-18-11 00:00:00' AS smalldatetime), 2, 150000, -1),
	('Пушкина', '29', 12, CAST('2022-26-11 00:00:00' AS smalldatetime), 36, 100, -1)

Go


